{
  "architectures": ["Qwen3OmniForConditionalGeneration"],
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "max_position_embeddings": 32768,
  "model_type": "qwen3_omni",
  "vocab_size": 151936
}
